Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/migrant_workers/migrant_workers_and_unemployment.html.txt.tmx
Source language: en
Languages: ga

source: Migrant workers and unemployment
ga: Oibrithe imirceacha agus dífhostaíocht

source: If you have come to work in Ireland and you lose your job, it can be a very difficult situation
ga: Níl sé éasca teacht go hÉirinn le dul ag obair agus ansin do phost a chailleadh

source: If you are not an Irish citizen you need to find out your rights and entitlements in relation to redundancy, looking for work, social welfare and getting a tax refund
ga: Mura saoránach Éireannach tú, ní mór duit fáil amach faoi do chearta agus do theidlíochtaí maidir le hiomarcaíocht, lorg oibre, leas sóisialach agus aisíoc cánach a fháil

source: If you are an EEA or Swiss national, you can stay in Ireland if you are unemployed and looking for work
ga: Más náisiúnach de chuid an LEE tú nó an Eilvéis, is féidir leat fanacht in Éirinn má tá tú dífhostaithe agus tú ag lorg oibre

source: The EEA or European Economic Area consists of the 28 EU member states, Iceland, Norway and Liechtenstein
ga: Tá 28 ballstát AE, an Íoslainn, an Iorua agus Lichtinstéin ann mar chuid den Limistéar Eorpach Eacnamaíoch nó (LEE)

source: If you are a non-EEA national who has an employment permit there are special arrangements for employment permit holders who are made redundant – see ‘Employment permits’ below
ga: Murar náisiúnach de chuid an LEE tú a bhfuil cead fostaíochta agat, tá socruithe speisialta ann do shealbhóirí cead fostaíochta a chailleann a bpost de bharr iomarcaíochta - féach ‘Ceadanna fostaíochta’ thíos

source: If you are a non-EEA national with an employment permit, there are special conditions that apply to employment permit holders who have been made redundant within the last 6 months
ga: Murar náisiúnach de chuid an LEE tú a bhfuil cead fostaíochta agat, tá coinníollacha speisialta ann a bhaineann le sealbhóirí cead fostaíochta a chaill a bpost le 6 mhí anuas

source: You should notify the Department of Jobs, Enterprise and Innovation within 28 days of your dismissal
ga: Ba chóir duit fógra a thabhairt don Roinn Post, Fiontar agus Nuálaíochta lastigh 28 lá do dhífhostú

source: If you have been made redundant after working on a work permit for 5 consecutive years you will no longer need a permit to work in Ireland
ga: Má rinneadh iomarcach tú tar éis oibriú go leanúnach ar chead oibre ar feadh 5 bliana ní bheidh gá duit cead oibre a thuilleadh chun oibriú in Éirinn

source: If you entered the State on a valid employment permit but you fell out of the system through no fault of your own, or you have been badly treated or exploited in the workplace, you may be eligible for a Reactivation Employment Permit
ga: Má tháinig tú isteach sa Stát ar chead fostaíochta, ach thit tú amach as an gcóras gan aon locht ort, nó toisc gur caitheadh leat go dona nó dúshaothraíodh tú san áit oibre , d’fhéadfá bheith i dteideal Cead Fostaíochta um Athghníomhachtúcháin

source: If you are dismissed by your employer you should check if it is a redundancy situation, for example, the closure of a business
ga: Má dhífhostaíonn d’fhostóir tú ba chóir duit a sheiceáil an iomarcaíocht atá i gceist, mar shampla, má tá an gnó á dhúnadh

source: If it is not a genuine redundancy or if you think you have been unfairly selected for redundancy, you may qualify to bring a claim for unfair dismissal
ga: Murar fíor-iomarcaíocht atá ann nó má cheapann tú gur roghnaíodh tú le haghaidh na hiomarcaíochta go héagórach, d’fhéadfadh tú a bheith incháilithe chun éileamh a dhéanamh ar dhífhostú éagórach

source: Your employer must prove that there was a genuine redundancy situation and that fair procedures were followed
ga: Ní mór dod’ fhostóir a chruthú go raibh fíorchás iomarcaíochta ann agus go ndearnadh nósanna imeachta cothroma a leanúint

source: If it is a genuine redundancy situation, you may be entitled to a redundancy payment if you have been working for your employer for 2 or more years
ga: Más fíorchás iomarcaíochta atá i gceist, d’fhéadfá a bheith i dteideal íocaíocht iomarcaíochta má tá tú ag obair dod’ fhostóir ar feadh 2 bhliain nó níos mó

source: You may have other entitlements such as notice and holiday pay
ga: D’fhéadfadh teidlíochtaí eile a bheith agat cosúil le pá fógra agus pá saoire

source: Jobseeker's Benefit: You may be entitled to Jobseeker’s Benefit(JB) when you lose your job or are made redundant
ga: Sochar Cuardaitheora Poist: D’fhéadfá a bheith i dteideal Sochar Cuardaitheora Poist (SCP), nuair a chailleann tú do phost nó nuair a fhaigheann tú iomarcaíocht

source: To get JB you must be unemployed and looking for work and you must have paid a certain number of social insurance (PRSI) contributions
ga: Caithfidh tú a bheith dífhostaithe agus ag lorg oibre agus ní mór duit méid áirithe ranníocaíochtaí árachais shóisialta (ÁSPC) a bheith agat freisin chun SCP a fháil

source: EEA migrant workers may combine their social insurance contributions paid in another EU country to help them qualify for JB
ga: Is féidir le hoibrithe LEE a ranníocaíochtaí árachais sóisialach atá íoctha i dtír AE eile a chomhcheangal chun cuidiú leo le bheith incháilithe do SCP

source: Non-EEA migrant workers who qualify for JB can get it as long as they are legally resident in Ireland
ga: Is féidir le hoibrithe imirceach nach ón AE/LEE atá cáilithe le haghaidh SCP é a fháil chomh fada is go bhfuil cónaí dlíthiúil ort in Éirinn

source: Jobseeker's Allowance: If you are not entitled to Jobseeker’s Benefit, you can apply for Jobseeker’s Allowance (JA)
ga: Liúntas Cuardaitheora Poist: Mura mbíonn tú i dteideal Sochar Cuardaitheora Poist a fháil, is féidir leat iarratas a dhéanamh ar Liúntas Cuardaitheora Poist (SCP

source: Jobseeker’s Allowance is a means-tested payment
ga: Is íocaíocht de réir tástála acmhainne í Liúntas Cuardaitheora Poist

source: To get JA you must be unemployed, looking for work and pass a means test
ga: Caithfidh tú a bheith dífhostaithe, ag lorg oibre scrúdú acmhainne a shásamh chun LCP a fháil

source: You must also be habitually resident to get JA
ga: Caithfidh tú gnáthchónaí a bheith ort sa tír freisin chun an Liúntas Cuardaitheora Poist a fháil

source: EEA migrant workers who do not qualify for Jobseeker's Benefit, will meet the habitual residence requirement for Supplementary Welfare Allowance (SWA) if they are actively looking for work
ga: Má tá oibrithe imirceach LEE, nach gcáilíonn i gcomhar Sochair Cuardaitheora Poist, dáiríre ag lorg oibre, is féidir leo an riachtanas gnáthchónaí i gcomhar Liúntais Leasa Forlíontach (LLF) a shásamh

source: If they have been working in Ireland for less than 12 months, they are entitled to get SWA for 6 months from the date their employment ended
ga: Má tá siad ag obair in Éirinn níos lú ná 12 mhí, beidh siad i dteideal LLF a fháil ar feadh 6 mhí

source: If they have been employed for more than 12 months they are entitled get SWA as long as they are actively looking for work
ga: Má tá siad ag obair in Éirinn níos mó ná 12 mhí, beidh siad i dteideal LLF a fháil chomh fada is go bhfuil siad ag lorg oibre go gníomhach

source: Rent Supplement: If you are getting JB, JA or SWA and paying rent to a private landlord, you may be entitled to Rent Supplement
ga: Forlíonadh Cíos: Má tá tú ag fáil SCP, LCP nó LLF agus go bhfuil tú ag íoc cíos le tiarna talún príobháideach, d'fhéadfá a bheith i dteideal Forlíonadh Cíosa a fháil

source: However, to get Rent Supplement you must pass a means test and be habitually resident in Ireland
ga: Caithfear tástáil acmhainne a shásamh agus gnáthchónaí a bheith ort, áfach, chun Forlíonadh Cíosa a fháil

source: Non-EEA students are not entitled to social welfare payments in Ireland
ga: Níl mic léinn neamh-LEE i dteideal íocaíochtaí leasa shóisialaigh in Éirinn a fháil

source: You may be entitled to a tax refund, if you have paid tax and you are now unemployed
ga: D’fhéadfá a bheith i dteideal aisíoc cánach má d’íoc tú cáin agus tú dífhostaithe anois

source: If you have not paid any tax, you will not be due a refund
ga: Murar íoc tú aon cháin, ní bheidh aisíoc dlite duit

source: If you are getting another income which is taxable, for example, Jobseeker’s Benefit, you should wait for 8 weeks from the date you became unemployed before applying for a refund
ga: Má tá ioncam eile á fháil agat atá inchánach, mar shampla Sochar Cuardaitheora Poist, ba chóir duit fanacht ar feadh 8 seachtaine ón dáta a dhífhostaítear tú sula ndéanann tú iarratas ar aisíoc

source: If you are not getting Jobseeker’s Benefit and have no other taxable income, you should wait 4 weeks from the date you become unemployed before applying for a refund
ga: Mura bhfuil tú ag fáil Sochair Cuardaitheora Poist agus mura bhfuil aon ioncam inchánach eile agat, ba chóir duit fanacht 4 seachtaine ón dáta a dhífhostaítear tú sula ndéanann tú iarratas ar aisíoc

source: If emergency tax was being deducted by your former employer you should apply immediately
ga: Má bhí cáin éigeandála á baint ag d'iarfhostóir ba chóir duit iarratas a dhéanamh láithreach

source: If you have no work and you are not entitled to a social welfare payment you may find it very difficult to continue living in Ireland, particularly if you do not have permission to remain
ga: Mura bhfuil aon obair agat agus nach bhfuil tú i dteideal íocaíocht leasa shóisialaigh d’fhéadfadh go mbeadh sé an-deacair ort maireachtáil in Éirinn, go háirithe mura bhfuil cead fanachta agat

source: There are a number of organisations in Ireland providing supports for foreign nationals in particular:
ga: Tá roinnt eagraíochtaí in Éirinn a chuireann tacaíocht ar fáil do náisiúnaigh choigríche go háirithe:

source: • The Immigrant Council of Ireland (ICI) – see ‘Where to apply’ below – is an independent, national organisation which supports migrants coming to Ireland for purposes such as work, study, family reunification, self-employment or to visit
ga: • Comhairle Inimirceach na hÉireann - féach ‘Cá háit a ndéanfaidh mé iarratas’ thíos - eagraíocht náisiúnta, neamhspleách a thacaíonn le himircigh a thagann go hÉirinn ar chúiseanna a bhaineann le hobair, staidéar, teaghlach a thabhairt le chéile, féinfhostaíocht nó ar chuairt

source: ICI provides an information service and a limited legal service to immigrants
ga: Cuireann Comhairle Inimirceach na hÉireann seirbhís faisnéise agus seirbhís theoranta dlí ar fáil d’inimircigh

source: The MRC operates a drop-in centre which provides information, advice and assistance.see ‘Where to apply’ below – is a national organisation which provides support to migrant workers and their families
ga: • Is eagraíocht náisiúnta é an tIonad um Chearta d’Imircigh - féach ‘Cá háit a ndéanfaidh mé iarratas’ thíos - a chuireann tacaíocht ar fáil do oibrithe imirceacha agus dá dteaghlaigh

source: The MRC operates a drop-in centre which provides information, advice and assistance
ga: Feidhmíonn an tIonad um Chearta d’Imircigh ionad buail isteach a chuireann faisnéis, comhairle agus cabhair ar fáil

source: The following schemes may help you if you decide to leave Ireland to return to your country of origin:
ga: D’fhéadfadh na scéimeanna seo a leanas cabhrú leat má shocraíonn tú Éire a fhágáil chun filleadh ar do thír dhúchais

source: The Reception and Integration Agency works with the Department of Social Protection to support the repatriation of nationals of the new EU member states
ga: Oibríonn an Ghníomhaireacht um Fháiltiú agus Imeascadh leis an Roinn Coimirce Sóisialaí chun tacú le aisdúichiú náisiúnach as na Ballstáit nua de chuid an AE

source: The scheme applies to people who have failed the habitual residency condition attaching to social assistance payments
ga: Baineann an scéim seo le daoine ar theip orthu an coinníoll gnáthchónaithe a bhaineann le híocaíochtaí leasa shóisialaigh a chomhlíonadh

source: Any citizen of a former EU accession state, and certain other ‘special-case’ EU nationals, who find themselves destitute during their time in Ireland can apply for this scheme
ga: Is féidir le haon saoránach as iar-stát aontachais an AE agus náisiúnaigh AE eile a bhfuil ‘cás speisialta’ acu, a bhíonn dealbh le linn a dtréimhse in Éirinn iarratas ar an scéim seo a dhéanamh

source: If you wish to apply for this scheme you should contact the Department of Social Protection's representative (formerly known as the Community Welfare Officer) at your local health centre
ga: Chun iarratas a dhéanamh ar an scéim seo, téigh i dteagmháil leis an t-ionadaí Roinne Coimirce Sóisialaí (a tugadh an tOifigeach Leasa Pobail air roimhe seo) i d'ionad sláinte áitiúil

source: Scheme of voluntary assisted return
ga: Scéim um fhilleadh dheonach chuidithe

source: If you are an asylum seeker or an irregular migrant from an non-EEA country who wishes to return voluntarily to your country of origin but do not have the means to do so, the International Organisation for Migration (IOM) may be able to assist you to return home – see ‘Where to apply' below
ga: Más iarrthóir tearmainn tú nó imirceoir neamhrialta ó thír taobh amuigh den LEE gur mian leat filleadh ar do thír dhúchais ach nach féidir leat féin é sin a dhéanamh, d’fhéadfadh sé go mbeadh an Eagraíocht Idirnáisiúnta um Imirce ábalta cabhrú leat filleadh abhaile - féach ‘Cá háit a ndéanfaidh mé iarratas' thíos

source: If you return voluntarily and you have no outstanding criminal court proceedings, you may apply to re-enter Ireland legally for the purpose of work, study, etc
ga: Má fhilleann tú go deonach agus nach bhfuil aon imeachtaí cúirte coiriúla fós agat, is féidir leat iarratas a dhéanamh chun teacht ar ais isteach sa tír ar mhaithe le hobair, staidéar, srl
